
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Взаиморасчеты Приход
	Движения.Взаиморасчеты.Записывать = Истина;
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = Клиент;
		Движение.Сумма = СуммаДокумента;
	
	
	
	// регистр ТоварыНаСкладах Расход
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Товар;
		Движение.Склад = Склад;
		Движение.Количетсво = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	Движения.Записать();
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда
		             		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.КоличетсвоОстаток КАК Количетсво
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			Склад = &Склад
		|				И Номенклатура В
		|					(ВЫБРАТЬ
		|						РеализацияТоваровИУслуг.Товары.(				РеализацияТоваровИУслуг.Товары.Ссылка КАК Ссылка,
		|							РеализацияТоваровИУслуг.Товары.НомерСтроки КАК НомерСтроки,
		|							РеализацияТоваровИУслуг.Товары.Товар КАК Товар,
		|							РеализацияТоваровИУслуг.Товары.Количество КАК Количество,
		|							РеализацияТоваровИУслуг.Товары.Цена КАК Цена,
		|							РеализацияТоваровИУслуг.Товары.Сумма КАК Сумма) КАК Товары
		|					ИЗ
		|						Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
		|					ГДЕ
		|						РеализацияТоваровИУслуг.Ссылка = &Ссылка)) КАК ТоварыНаСкладахОстатки
		|ГДЕ
		|	ТоварыНаСкладахОстатки.КоличетсвоОстаток < 0";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
		Сообщить("Недостаточно товара "+ВыборкаДетальныеЗаписи.Номенклатура+" в количестве "+ВыборкаДетальныеЗаписи.Количество);
	КонецЦикла;
	   КонецЕсли;
	
		КонецЕсли;
	

		Если Отказ Тогда
			Возврат;
			КонецЕсли;
			
	         Движения.СебестоимостьТовара.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;

	
	      		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СебестоимостьТовараОстатки.Номенклатура КАК Номенклатура,
		|	СебестоимостьТовараОстатки.СуммаОстаток КАК Сумма,
		|	СебестоимостьТовараОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.СебестоимостьТовара.Остатки(
		|			&МоментВремени,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					РеализацияТоваровИУслуг.Товары.(			РеализацияТоваровИУслуг.Товары.Ссылка КАК Ссылка,
		|						РеализацияТоваровИУслуг.Товары.НомерСтроки КАК НомерСтроки,
		|						РеализацияТоваровИУслуг.Товары.Товар КАК Товар,
		|						РеализацияТоваровИУслуг.Товары.Количество КАК Количество,
		|						РеализацияТоваровИУслуг.Товары.Цена КАК Цена,
		|						РеализацияТоваровИУслуг.Товары.Сумма КАК Сумма) КАК Товары
		|				ИЗ
		|					Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
		|				ГДЕ
		|					РеализацияТоваровИУслуг.Ссылка = &Ссылка)) КАК СебестоимостьТовараОстатки";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СуммаСебестоимости = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи <> 0 Тогда
		СебестоимостьЕдиницы = ВыборкаДетальныеЗаписи.Сумма/ВыборкаДетальныеЗаписи.Количество;
	Иначе СебестоимостьЕдиницы = 0;
		КонецЕсли;
		
		Движение = Движения.СебестоимостьТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		
		СтрокаТЧ = Товары.Найти(ВыборкаДетальныеЗаписи.Номенклатура, "Товар");
		
		Движение.Номенклатура =ВыборкаДетальныеЗаписи.Номенклатура;
				Движение.Количетсво = СтрокаТЧ.Количество;
				СебестоимостьСписания = СебестоимостьЕдиницы * СтрокаТЧ.Количество;
				Движение.Сумма = СебестоимостьСписания;
				
				
							Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Номенклатура =ВыборкаДетальныеЗаписи.Номенклатура;
		Движение.Количество = СтрокаТЧ.Количество;
		Движение.Сумма = СтрокаТЧ.Сумма;
		Движение.Себестоимость = СебестоимостьСписания;
		СуммаСебестоимости = СуммаСебестоимости + СебестоимостьСписания;
	КонецЦикла;
	КонецЕсли;
Движения.РегистрБухУчет.Записывать = Истина;
Проводка = Движения.РегистрБухУчет.Добавить();
Проводка.Период    = Дата;
Проводка.СчетДт = ПланыСчетов.БухгалтерскийУчет.Покупатели;
Проводка.СчетКт = ПланыСчетов.БухгалтерскийУчет.Выручка;
Проводка.Сумма = СуммаДокумента;

Проводка = Движения.РегистрБухУчет.Добавить();
Проводка.Период    = Дата;
Проводка.СчетДт = ПланыСчетов.БухгалтерскийУчет.Себестоимость;
Проводка.СчетКт = ПланыСчетов.БухгалтерскийУчет.Товары;
Проводка.Сумма = СуммаСебестоимости;



КонецПроцедуры;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = 0;
	Для Каждого  СтрокаТЧ ИЗ Товары Цикл
		СуммаДокумента = СуммаДокумента + СтрокаТЧ.Сумма
		КонецЦикла;
КонецПроцедуры
