Перем Число;

//Сообщить("Привет, мир!");
Сообщить("Hello World!");

Число = 777;
Сообщить(Число);
Число = 888;
Сообщить(Число);
//
//Если Число = 777  Тогда
//	Сообщить("Верно");
//ИначеЕсли Число = 888 Тогда
//	Сообщить("Ошибка");
//КонецЕсли
//
//Для Счетчик = 1 По 20 Цикл
//	Сообщить(Счетчик);
//	Сообщить(Счетчик* Счетчик);
////КонецЦикла
//ИскомоеЧисло = 1;
//
//Пока ИскомоеЧисло*ИскомоеЧисло<3000 Цикл
//	
//	ИскомоеЧисло = ИскомоеЧисло+1; 
//	КонецЦикла;
//Сообщить(ИскомоеЧисло-1);

Если Число >800 И Число<1000 Тогда
	Сообщить("входит");
КонецЕсли;

Если Число >800 ИЛИ  Число<1000 Тогда
	Сообщить("входит");
КонецЕсли;

Если НЕ(Число<1000) Тогда
	Сообщить("входит");
	КонецЕсли;